{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,127],"dtype":"float32","sparse":false,"name":"input1"}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}},{"class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true}},{"class_name":"Dense","config":{"units":18,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true}}]},"keras_version":"tfjs-layers 4.8.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"batch_normalization_BatchNormalization1/gamma","shape":[127],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[127],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[127,16],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[16,16],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[16,32],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[32,18],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[18],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[127],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[127],"dtype":"float32"},{"name":"iter","shape":[],"dtype":"int32","group":"optimizer"},{"name":"batch_normalization_BatchNormalization1/gamma/m","shape":[127],"dtype":"float32","group":"optimizer"},{"name":"batch_normalization_BatchNormalization1/beta/m","shape":[127],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense1/kernel/m","shape":[127,16],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense1/bias/m","shape":[16],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense2/kernel/m","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense2/bias/m","shape":[16],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense3/kernel/m","shape":[16,32],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense3/bias/m","shape":[32],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense4/kernel/m","shape":[32,32],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense4/bias/m","shape":[32],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense5/kernel/m","shape":[32,18],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense5/bias/m","shape":[18],"dtype":"float32","group":"optimizer"},{"name":"batch_normalization_BatchNormalization1/gamma/v","shape":[127],"dtype":"float32","group":"optimizer"},{"name":"batch_normalization_BatchNormalization1/beta/v","shape":[127],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense1/kernel/v","shape":[127,16],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense1/bias/v","shape":[16],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense2/kernel/v","shape":[16,16],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense2/bias/v","shape":[16],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense3/kernel/v","shape":[16,32],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense3/bias/v","shape":[32],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense4/kernel/v","shape":[32,32],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense4/bias/v","shape":[32],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense5/kernel/v","shape":[32,18],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense5/bias/v","shape":[18],"dtype":"float32","group":"optimizer"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.8.0","convertedBy":null,"trainingConfig":{"loss":"categorical_crossentropy","metrics":["accuracy","precision"],"optimizer_config":{"class_name":"Adam","config":{"learningRate":0.001,"beta1":0.9,"beta2":0.999,"epsilon":1e-7}}}}